Repository: huungocc/todo_flutter_training
Catalog: lib/l10n/intl_*.arb
Languages: vi

# error_connection_timeout
source: Connection timed out, please try again
vi: Kết nối quá thời gian, vui lòng thử lại

# error_receive_timeout
source: Receiving data timed out, please try again
vi: Nhận dữ liệu quá lâu, vui lòng thử lại

# error_400
source: Bad request
vi: Yêu cầu không hợp lệ

# error_401
source: Unauthorized access
vi: Không có quyền truy cập

# error_403
source: Access forbidden
vi: Bị từ chối truy cập

# error_404
source: Data not found
vi: Không tìm thấy dữ liệu

# error_500
source: Internal server error
vi: Lỗi máy chủ nội bộ

# error_502
source: Gateway error
vi: Lỗi gateway

# error_503
source: Service unavailable
vi: Dịch vụ không khả dụng

# error_unknown_server
source: Server error: {statusCode}
vi: Lỗi máy chủ: {statusCode}

# error_no_connection
source: No network connection, please check again
vi: Không có kết nối mạng, vui lòng kiểm tra lại

# error_canceled
source: Request canceled
vi: Yêu cầu đã bị hủy

# error_send_timeout
source: Sending data timed out
vi: Gửi dữ liệu quá thời gian

# error_bad_certificate
source: Invalid SSL certificate
vi: Chứng chỉ SSL không hợp lệ

# error_unknown
source: Unknown error: {message}
vi: Lỗi không xác định: {message}

# syntax_error_format
source: Invalid data: {message}
vi: Dữ liệu không hợp lệ: {message}

# syntax_error_type
source: Data processing error: Invalid data type
vi: Lỗi xử lý dữ liệu: Kiểu dữ liệu không đúng

# syntax_error_no_method
source: Processing error: Method does not exist
vi: Lỗi xử lý: Phương thức không tồn tại

# syntax_error_range
source: Data access error: {message}
vi: Lỗi truy cập dữ liệu: {message}

# syntax_error_argument
source: Invalid argument: {message}
vi: Tham số không hợp lệ: {message}

# syntax_error_state
source: State error: {message}
vi: Lỗi trạng thái: {message}

# syntax_error_unsupported
source: Unsupported feature: {message}
vi: Chức năng không được hỗ trợ: {message}

# syntax_error_unimplemented
source: Feature not implemented
vi: Chức năng chưa được triển khai

# syntax_error_assertion
source: Logic error: {message}
vi: Lỗi logic: {message}

source: My Todo List
vi: Việc cần làm

source: Add New Task
vi: Thêm công việc mới

source: Task Title
vi: Tiêu đề công việc

source: Category
vi: Danh mục

source: Date
vi: Ngày

source: Time
vi: Thời gian

source: Notes
vi: Ghi chú

source: Save
vi: Lưu

source: Loading movies...
vi: Đang tải phim...

source: Completed
vi: Đã hoàn thành

source: Edit Task
vi: Sửa công việc

# success_operation
source: Operation successful
vi: Thao tác thành công

# todo_add_success
source: Added successfully
vi: Thêm thành công

# todo_update_success
source: Updated successfully
vi: Cập nhật thành công

# todo_update_status_success
source: Status updated successfully
vi: Cập nhật trạng thái thành công

# todo_delete_success
source: Deleted successfully
vi: Xoá thành công

source: Please fill in all fields
vi: Vui lòng nhập đủ các trường

# complete_task
source: Complete this task?
vi: Hoàn thành công việc này?

# cancel_complete_task
source: Cancel complete this task?
vi: Huỷ hoàn thành công việc này?

source: Cancel
vi: Huỷ

source: No data yet
vi: Chưa có dữ liệu

source: Unknown
vi: Không xác định

source: Unsupported Platform
vi: Nền tảng không hỗ trợ

# error_duplicate_data
source: Data already exists
vi: Dữ liệu đã tồn tại

# error_foreign_key_violation
source: Foreign key constraint violation
vi: Vi phạm ràng buộc dữ liệu

# error_authentication
source: Authentication error: {message}
vi: Lỗi xác thực: {message}

# error_connection
source: Connection error: {message}
vi: Lỗi kết nối: {message}

# supabase_not_initialized
source: Supabase is not initialized. Please call SupabaseUtil.initialize() first.
vi: Supabase chưa được khởi tạo. Gọi SupabaseUtil.initialize() trước.

# todo_title_empty
source: Task title cannot be empty.
vi: Tiêu đề công việc không được để trống.

# todo_category_empty
source: Please select a category.
vi: Vui lòng chọn danh mục.

# todo_time_empty
source: Please select a date.
vi: Vui lòng chọn ngày.

# todo_date_empty
source: Please select a time.
vi: Vui lòng chọn giờ.

source: Login here
vi: Đăng nhập tại đây

# welcome_back
source: Welcome back youâ€™ve been missed!
vi: Chào mừng bạn quay trở lại!

source: Password
vi: Mật khẩu

# forgot_password
source: Forgot your password?
vi: Quên mật khẩu?

source: Sign in
vi: Đăng nhập

source: Create new account
vi: Tạo tài khoản mới

source: Create Account
vi: Tạo tài khoản

# create_account_explore
source: Create an account if you don't have
vi: Tạo tài khoản nếu bạn chưa có

source: Confirm Password
vi: Xác nhận mật khẩu

source: Sign up
vi: Đăng ký

# already_account
source: Already have an account
vi: Đã có tài khoản
